tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePost/0_gold/cellMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      cellMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); 

boundaryField
{
    walls 
    {
        type            zeroGradient;
    }

    outlet 
    {
        type            cellMotion;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            cellMotion;
        value           uniform (0 0 0);
    }
    movingWalls
    {
        type            cellMotion;
        value           uniform (0 0 0); 
    }
}


// ************************************************************************* //
